colors = [
    {
        "cmyk": "0,37,26,0",
        "rgb": "255,179,167",
        "hex": "#ffb3a7",
        "name": "粉红",
        "desc": "粉红，即浅红色。别称：妃色杨妃色湘妃色妃红色。"
    },
    {
        "cmyk": "1,81,87,0",
        "rgb": "237,87,54",
        "hex": "#ed5736",
        "name": "妃色",
        "desc": "妃红色：古同“绯”，粉红色。杨妃色 湘妃色 粉红皆同义。"
    },
    {
        "cmyk": "0,100,53,0",
        "rgb": "240,0,86",
        "hex": "#f00056",
        "name": "品红",
        "desc": "品红：比大红浅的红色。"
    },
    {
        "cmyk": "0,66,34,0",
        "rgb": "244,121,131",
        "hex": "#f47983",
        "name": "桃红",
        "desc": "桃红，桃花的颜色，比粉红略鲜润的颜色。 "
    },
    {
        "cmyk": "10,79,47,0",
        "rgb": "219,90,107",
        "hex": "#db5a6b",
        "name": "海棠红",
        "desc": "海棠红，淡紫红色、较桃红色深一些，是非常妩媚娇艳的颜色。 "
    },
    {
        "cmyk": "0,100,100,0",
        "rgb": "242,12,0",
        "hex": "#f20c00",
        "name": "石榴红",
        "desc": "石榴红：石榴花的颜色，高色度和纯度的红色。 "
    },
    {
        "cmyk": "16,93,57,3",
        "rgb": "201,55,86",
        "hex": "#c93756",
        "name": "樱桃色",
        "desc": "樱桃色：鲜红色。 "
    },
    {
        "cmyk": "0,81,65,0",
        "rgb": "240,86,84",
        "hex": "#f05654",
        "name": "银红",
        "desc": "银红：银朱和粉红色颜料配成的颜色。多用来形容有光泽的各种红色，尤指有光泽浅红。 "
    },
    {
        "cmyk": "0,96,92,0",
        "rgb": "255,33,33",
        "hex": "#ff2121",
        "name": "大红",
        "desc": "大红：正红色，三原色中的红，传统的中国红，又称绛色。 "
    },
    {
        "cmyk": "37,81,50,20",
        "rgb": "140,67,86",
        "hex": "#8c4356",
        "name": "绛紫",
        "desc": "绛紫：紫中略带红的颜色。 "
    },
    {
        "cmyk": "15,90,100,5",
        "rgb": "200,60,35",
        "hex": "#c83c23",
        "name": "绯红",
        "desc": "绯红：艳丽的深红。 "
    },
    {
        "cmyk": "26,95,80,21",
        "rgb": "157,41,51",
        "hex": "#9d2933",
        "name": "胭脂",
        "desc": "胭脂：1，女子装扮时用的胭脂的颜色。 2，国画暗红色颜料 。 "
    },
    {
        "cmyk": "0,84,100,0",
        "rgb": "255,76,0",
        "hex": "#ff4c00",
        "name": "朱红",
        "desc": "朱红：朱砂的颜色，比大红活泼，也称铅朱朱色丹色。 "
    },
    {
        "cmyk": "0,84,94,0",
        "rgb": "255,78,32",
        "hex": "#ff4e20",
        "name": "丹",
        "desc": "丹：丹砂的鲜艳红色"
    },
    {
        "cmyk": "0,83,86,0​​",
        "rgb": "243,83,54",
        "hex": "#f35336",
        "name": "彤",
        "desc": "彤：赤色。"
    },
    {
        "cmyk": "15,92,58,2",
        "rgb": "203,58,86",
        "hex": "#cb3a56",
        "name": "茜色",
        "desc": "茜色：茜草染的色彩，呈深红色。"
    },
    {
        "cmyk": "0,93,60,0",
        "rgb": "255,45,81",
        "hex": "#ff2d51",
        "name": "火红",
        "desc": "火红：火焰的红色，赤色。"
    },
    {
        "cmyk": "14,100,83,4",
        "rgb": "201,31,55",
        "hex": "#c91f37",
        "name": "赫赤",
        "desc": "赫赤：深红，火红。泛指赤色、火红色。 "
    },
    {
        "cmyk": "2,65,36,0",
        "rgb": "239,122,130",
        "hex": "#ef7a82",
        "name": "嫣红",
        "desc": "嫣红：鲜艳的红色。"
    },
    {
        "cmyk": "0,0,96,0",
        "rgb": "255,0,151",
        "hex": "#ff0097",
        "name": "洋红",
        "desc": "洋红：色橘红。"
    },
    {
        "cmyk": "0,92,100,0",
        "rgb": "255,51,0",
        "hex": "#ff3300",
        "name": "炎",
        "desc": "炎：引申为红色。 "
    },
    {
        "cmyk": "16,98,95,6",
        "rgb": "195,39,43",
        "hex": "#c3272b",
        "name": "赤",
        "desc": "赤：本义火的颜色，即红色。"
    },
    {
        "cmyk": "33,49,50,5",
        "rgb": "169,129,117",
        "hex": "#a98175",
        "name": "绾",
        "desc": "绾：绛色；浅绛色。 "
    },
    {
        "cmyk": "16,99,83,6",
        "rgb": "195,33,54",
        "hex": "#c32136",
        "name": "枣红",
        "desc": "枣红：即深红"
    },
    {
        "cmyk": "26,63,59,7",
        "rgb": "179,109,97",
        "hex": "#b36d61",
        "name": "檀",
        "desc": "檀：浅红色，浅绛色。 "
    },
    {
        "cmyk": "17,100,86,8",
        "rgb": "190,0,47",
        "hex": "#be002f",
        "name": "殷红",
        "desc": "殷红：发黑的红色。 "
    },
    {
        "cmyk": "8,95,100,1",
        "rgb": "220,48,35",
        "hex": "#dc3023",
        "name": "酡红",
        "desc": "酡红：像饮酒后脸上泛现的红色，泛指脸红"
    },
    {
        "cmyk": "0,53,55,0",
        "rgb": "249,144,111",
        "hex": "#f9906f",
        "name": "酡颜",
        "desc": "酡颜：饮酒脸红的样子。亦泛指脸红色"
    },
    {
        "cmyk": "3,0,83,0",
        "rgb": "255,241,67",
        "hex": "#fff143",
        "name": "鹅黄",
        "desc": "鹅黄：淡黄色。"
    },
    {
        "cmyk": "6,0,67,0",
        "rgb": "250,255,114",
        "hex": "#faff72",
        "name": "鸭黄",
        "desc": "鸭黄：小鸭毛的黄色。"
    },
    {
        "cmyk": "13,0,80,0",
        "rgb": "234,255,86",
        "hex": "#eaff56",
        "name": "樱草色",
        "desc": "樱草色：淡黄色。"
    },
    {
        "cmyk": "0,41,90,0",
        "rgb": "255,166,49",
        "hex": "#ffa631",
        "name": "杏黄",
        "desc": "杏黄：成熟杏子的黄色。"
    },
    {
        "cmyk": "0,55,89,0",
        "rgb": "255,140,​​49",
        "hex": "#ff8c31",
        "name": "杏红",
        "desc": "杏红：成熟杏子偏红色的一种颜色。"
    },
    {
        "cmyk": "0,57,86,0​​",
        "rgb": "255,137,54",
        "hex": "#ff8936",
        "name": "橘黄",
        "desc": "橘黄：柑橘的黄色。 "
    },
    {
        "cmyk": "0,41,100,0",
        "rgb": "255,164,0",
        "hex": "#ffa400",
        "name": "橙黄",
        "desc": "橙黄：橙的黄色。 （现代感比较强。广告上用得较多）"
    },
    {
        "cmyk": "0,67,100,0",
        "rgb": "255,117,0",
        "hex": "#ff7500",
        "name": "橘红",
        "desc": "橘红：柑橘皮所呈现的红色"
    },
    {
        "cmyk": "0,24,63,0",
        "rgb": "255,199,115",
        "hex": "#ffc773",
        "name": "姜黄",
        "desc": "姜黄：中药名。别名黄姜。为姜科植物姜黄的根茎。又指人脸色不正,呈黄白色。"
    },
    {
        "cmyk": "6,23,90,0",
        "rgb": "240,194,57",
        "hex": "#f0c239",
        "name": "缃色",
        "desc": "缃色：浅黄色。 "
    },
    {
        "cmyk": "0,55,88,0",
        "rgb": "250,140,​​53",
        "hex": "#fa8c35",
        "name": "橙色",
        "desc": "橙色：界于红色和黄色之间的混合色。 "
    },
    {
        "cmyk": "23,72,77,10",
        "rgb": "179,92,68",
        "hex": "#b35c44",
        "name": "茶色",
        "desc": "茶色：一种比栗色稍红的棕橙色至浅棕色。"
    },
    {
        "cmyk": "32,46,65,7",
        "rgb": "168,132,98",
        "hex": "#a88462",
        "name": "驼色",
        "desc": "驼色：一种比哢叽色稍红而微淡、比肉桂色黄而稍淡和比核桃棕色黄而暗的浅黄棕色。"
    },
    {
        "cmyk": "22,38,90,2",
        "rgb": "200,155,64",
        "hex": "#c89b40",
        "name": "昏黄",
        "desc": "昏黄：形容天色、灯光等呈幽暗的黄色。"
    },
    {
        "cmyk": "37,82,82,52",
        "rgb": "96,40,30",
        "hex": "#60281e",
        "name": "栗色",
        "desc": "栗色：栗壳的颜色。即紫黑色。"
    },
    {
        "cmyk": "23,70,100,11",
        "rgb": "178,93,37",
        "hex": "#b25d25",
        "name": "棕色",
        "desc": "棕色：棕毛的颜色,即褐色。 1，在红色和黄色之间的任何一种颜色2，适中的暗淡和适度的浅黑。 "
    },
    {
        "cmyk": "46,44,100,19",
        "rgb": "130,113,0",
        "hex": "#827100",
        "name": "棕绿",
        "desc": "棕绿：绿中泛棕色的一种颜色。 "
    },
    {
        "cmyk": "37,66,100,34",
        "rgb": "124,75,0",
        "hex": "#7c4b00",
        "name": "棕黑",
        "desc": "棕黑：深​​棕色。 "
    },
    {
        "cmyk": "27,79,100,23",
        "rgb": "155,68,0",
        "hex": "#9b4400",
        "name": "棕红",
        "desc": "棕红：红褐色。 "
    },
    {
        "cmyk": "27,57,100,11",
        "rgb": "174,112,0",
        "hex": "#ae7000",
        "name": "棕黄",
        "desc": "棕黄：浅褐色。 "
    },
    {
        "cmyk": "31,69,81,22",
        "rgb": "149,85,57",
        "hex": "#955539",
        "name": "赭色",
        "desc": "赭色：红色、赤红色。古人用以饰面。"
    },
    {
        "cmyk": "16,68,100,4",
        "rgb": "202,105,36",
        "hex": "#ca6924",
        "name": "琥珀",
        "desc": ""
    },
    {
        "cmyk": "44,58,100,36",
        "rgb": "110,81,30",
        "hex": "#6e511e",
        "name": "褐色",
        "desc": "褐色： 黄黑色"
    },
    {
        "cmyk": "18,29,57,0",
        "rgb": "211,177,125",
        "hex": "#d3b17d",
        "name": "枯黄",
        "desc": "枯黄：干枯焦黄。"
    },
    {
        "cmyk": "10,42,84,0",
        "rgb": "226,156,69",
        "hex": "#e29c45",
        "name": "黄栌",
        "desc": "黄栌：一种落叶灌木，花黄绿色,叶子秋天变成红色。木材黄色可做染料。 "
    },
    {
        "cmyk": "40,50,87,21",
        "rgb": "137,108,57",
        "hex": "#896c39",
        "name": "秋色",
        "desc": "秋色：1，中常橄榄棕色,它比一般橄榄棕色稍暗,且稍稍绿些。 2，古以秋为金,其色白,故代指白色。 "
    },
    {
        "cmyk": "17,25,100,0",
        "rgb": "217,182,17",
        "hex": "#d9b611",
        "name": "秋香色",
        "desc": "秋香色：浅橄榄色浅黄绿色。 （注：直接在Y中掺入k10~30可得到不同浓淡的该类色彩）"
    },
    {
        "cmyk": "31,0,100,0",
        "rgb": "189,221,34",
        "hex": "#bddd22",
        "name": "嫩绿",
        "desc": "嫩绿：像刚长出的嫩叶的浅绿色"
    },
    {
        "cmyk": "26,0,100,0",
        "rgb": "201,221,34",
        "hex": "#c9dd22",
        "name": "柳黄",
        "desc": "柳黄：像柳树芽那样的浅黄色"
    },
    {
        "cmyk": "36,0,100,0",
        "rgb": "175,221,34",
        "hex": "#afdd22",
        "name": "柳绿",
        "desc": "柳绿：柳叶的青绿色"
    },
    {
        "cmyk": "56,28,73,7",
        "rgb": "120,146,98",
        "hex": "#789262",
        "name": "竹青",
        "desc": "竹青：竹子的绿色"
    },
    {
        "cmyk": "41,0,100,0",
        "rgb": "163,217,0",
        "hex": "#a3d900",
        "name": "葱黄",
        "desc": "葱黄：黄绿色，嫩黄色"
    },
    {
        "cmyk": "43,0,100,0",
        "rgb": "158,217,0",
        "hex": "#9ed900",
        "name": "葱绿",
        "desc": "葱绿：1，浅绿又略显微黄的颜色2，草木青翠的样子"
    },
    {
        "cmyk": "78,0,100,0",
        "rgb": "14,184,58",
        "hex": "#0eb83a",
        "name": "葱青",
        "desc": "葱青：淡淡的青绿色"
    },
    {
        "cmyk": "83,1,100,1",
        "rgb": "10,163,68",
        "hex": "#0aa344",
        "name": "青葱",
        "desc": "青葱：翠绿色,形容植物浓绿"
    },
    {
        "cmyk": "78,0,100,0",
        "rgb": "0,188,18",
        "hex": "#00bc12",
        "name": "油绿",
        "desc": "油绿：光润而浓绿的颜色。以上几种绿色都是明亮可爱的色彩。 "
    },
    {
        "cmyk": "86,21,100,9",
        "rgb": "12,137,24",
        "hex": "#0c8918",
        "name": "绿沉",
        "desc": "绿沉：深绿"
    },
    {
        "cmyk": "67,0,50,0",
        "rgb": "27,209,165",
        "hex": "#1bd1a5",
        "name": "碧色",
        "desc": "碧色：1，青绿色。 2，青白色,浅蓝色。 "
    },
    {
        "cmyk": "63,0,56,0",
        "rgb": "42,221,156",
        "hex": "#2add9c",
        "name": "碧绿",
        "desc": "碧绿：鲜艳的青绿色"
    },
    {
        "cmyk": "66,0,46,0",
        "rgb": "72,192,163",
        "hex": "#48c0a3",
        "name": "青碧",
        "desc": "青碧：鲜艳的青蓝色"
    },
    {
        "cmyk": "59,0,47,0",
        "rgb": "61,225,173",
        "hex": "#3de1ad",
        "name": "翡翠色",
        "desc": "翡翠色：1，翡翠鸟羽毛的青绿色。 2，翡翠宝石的颜色。 (注：C-Y≧30\n  的系列色彩，多与白色配合以体现清新明丽感觉，与黑色配合效果不好：该色个性柔弱，会被黑色牵制)"
    },
    {
        "cmyk": "63,0,90,0",
        "rgb": "64,222,90",
        "hex": "#40de5a",
        "name": "草绿",
        "desc": "草绿：绿而略黄的颜色。 "
    },
    {
        "cmyk": "64,0,56,0",
        "rgb": "0,224,158",
        "hex": "#00e09e",
        "name": "青色",
        "desc": "青色：1，一类带绿的蓝色,中等深浅,高度饱和。 3，本义是蓝色。 4，一般指深绿色。 5，也指黑色。 6，四色印刷中的一色。 2，特指三补色中的一色。 "
    },
    {
        "cmyk": "66,0,76,0",
        "rgb": "0,224,121",
        "hex": "#00e079",
        "name": "青翠",
        "desc": "青翠：鲜绿 "
    },
    {
        "cmyk": "24,0,20,0",
        "rgb": "192,235,215",
        "hex": "#c0ebd7",
        "name": "青白",
        "desc": "青白：白而发青,尤指脸没有血色"
    },
    {
        "cmyk": "11,1,9,0",
        "rgb": "224,238,232",
        "hex": "#e0eee8",
        "name": "鸭卵青",
        "desc": "鸭卵青：淡青灰色，极淡的青绿色"
    },
    {
        "cmyk": "27,11,22,0",
        "rgb": "187,205,197",
        "hex": "#bbcdc5",
        "name": "蟹壳青",
        "desc": "蟹壳青：深灰绿色"
    },
    {
        "cmyk": "72,58,54,36",
        "rgb": "66,76,80",
        "hex": "#424c50",
        "name": "鸦青",
        "desc": "鸦青：鸦羽的颜色。即黑而带有紫绿光的颜色。 "
    },
    {
        "cmyk": "68,0,100,0",
        "rgb": "0,229,0",
        "hex": "#00e500",
        "name": "绿色",
        "desc": "绿色：1，在光谱中介于蓝与黄之间的那种颜色。 2，本义：青中带黄的颜色。 3，引申为黑色，如绿鬓：乌黑而光亮的鬓发。代指为青春年少的容颜。 "
    },
    {
        "cmyk": "43,0,92,0",
        "rgb": "158,208,72",
        "hex": "#9ed048",
        "name": "豆绿",
        "desc": "豆绿：浅黄绿色"
    },
    {
        "cmyk": "45,0,87,0",
        "rgb": "150,206,84",
        "hex": "#96ce54",
        "name": "豆青",
        "desc": "豆青：浅青绿色"
    },
    {
        "cmyk": "51,0,45,0",
        "rgb": "123,207,166",
        "hex": "#7bcfa6",
        "name": "石青",
        "desc": "石青：淡灰绿色"
    },
    {
        "cmyk": "62,0,53,0",
        "rgb": "46,223,163",
        "hex": "#7bcfa6",
        "name": "玉色",
        "desc": "玉色：玉的颜色，高雅的淡绿、淡青色"
    },
    {
        "cmyk": "44,0,46,0",
        "rgb": "127,236,173",
        "hex": "#7fecad",
        "name": "缥",
        "desc": "缥：绿色而微白"
    },
    {
        "cmyk": "34,0,29,0",
        "rgb": "164,226,198",
        "hex": "#a4e2c6",
        "name": "艾绿",
        "desc": "艾绿：艾草的颜色。偏苍白的绿色。 "
    },
    {
        "cmyk": "79,9,71,1",
        "rgb": "33,166,117",
        "hex": "#21a675",
        "name": "松柏绿",
        "desc": "松柏绿：经冬松柏叶的深绿"
    },
    {
        "cmyk": "89,29,88,17",
        "rgb": "5,119,72",
        "hex": "#057748",
        "name": "松花绿",
        "desc": "松花绿：亦作“松花”、“松绿”。偏黑的深绿色,墨绿。 "
    },
    {
        "cmyk": "89,29,88,17",
        "rgb": "5,119,72",
        "hex": "#bce672",
        "name": "松花色",
        "desc": "松花色：浅黄绿色。 （松树花粉的颜色）《红楼梦》中提及松花配桃红为娇艳"
    },
    {
        "cmyk": "58,0,2,0",
        "rgb": "68,206,246",
        "hex": "#44CEF6",
        "name": "蓝",
        "desc": "蓝：三原色的一种。像晴天天空的颜色（注：这里的蓝色指的不是RGB色彩中的B，而是CMY色彩中的C）\n"
    },
    {
        "cmyk": "85,44,12,1",
        "rgb": "23,124,176",
        "hex": "#177cb0",
        "name": "靛青",
        "desc": "靛青：也叫“蓝靛”。用蓼蓝叶泡水调和与石灰沉淀所得的蓝色染料。呈深蓝绿色\n  （注：有些地方将蓝墨水称为“靛水”或者“兰靛水”）"
    },
    {
        "cmyk": "97,68,31,14",
        "rgb": "6,82,121",
        "hex": "#065279",
        "name": "靛蓝",
        "desc": "靛蓝：由植物(例如靛蓝或菘蓝属植物)得到的蓝色染料"
    },
    {
        "cmyk": "53,0,19,0",
        "rgb": "62,237,231",
        "hex": "#3eede7",
        "name": "碧蓝",
        "desc": "碧蓝：青蓝色"
    },
    {
        "cmyk": "42,0,7,0",
        "rgb": "112,243,255",
        "hex": "#70f3ff",
        "name": "蔚蓝",
        "desc": "蔚蓝：类似晴朗天空的颜色的一种蓝色"
    },
    {
        "cmyk": "78,69,0,0",
        "rgb": "75,92,196",
        "hex": "#4b5cc4",
        "name": "宝蓝",
        "desc": "宝蓝：鲜艳明亮的蓝色（注：英文中为RoyalBlue\n  即皇家蓝色，是皇室选用的色彩，多和小面积纯黄色（金色）配合使用。 ）"
    },
    {
        "cmyk": "37,25,10,0",
        "rgb": "161,175,201",
        "hex": "#a1afc9",
        "name": "蓝灰色",
        "desc": "蓝灰色：一种近于灰略带蓝的深灰色"
    },
    {
        "cmyk": "91,74,26,10",
        "rgb": "46,78,126",
        "hex": "#2e4e7e",
        "name": "藏青",
        "desc": "藏青：蓝而近黑"
    },
    {
        "cmyk": "95,100,15,4",
        "rgb": "59,46,126",
        "hex": "#3b2e7e",
        "name": "藏蓝",
        "desc": "藏蓝：蓝里略透红色"
    },
    {
        "cmyk": "77,78,35,22",
        "rgb": "74,66,102",
        "hex": "#4a4266",
        "name": "黛",
        "desc": "黛：青黑色的颜料。古代女子用以画眉。 "
    },
    {
        "cmyk": "76,46,53,22",
        "rgb": "66,102,102",
        "hex": "#426666",
        "name": "黛绿",
        "desc": "黛绿：墨绿。 "
    },
    {
        "cmyk": "78,64,41,24",
        "rgb": "66,80,102",
        "hex": "#425066",
        "name": "黛蓝",
        "desc": "黛蓝：深蓝色"
    },
    {
        "cmyk": "71,79,36,22",
        "rgb": "87,66,102",
        "hex": "#574266",
        "name": "黛紫",
        "desc": "黛紫：深紫色"
    },
    {
        "cmyk": "56,79,0,0",
        "rgb": "141,75,187",
        "hex": "#8d4bbb",
        "name": "紫色",
        "desc": "紫色：蓝和红组成的颜色。古人以紫为祥瑞的颜色。代指与帝王、皇宫有关的事物。 "
    },
    {
        "cmyk": "46,70,45,19",
        "rgb": "129,84,99",
        "hex": "#815463",
        "name": "紫酱",
        "desc": "紫酱：浑浊的紫色"
    },
    {
        "cmyk": "52,74,33,10",
        "rgb": "129,84,118",
        "hex": "#815476",
        "name": "酱紫",
        "desc": "酱紫：紫中略带红的颜色"
    },
    {
        "cmyk": "43,79,77,63",
        "rgb": "76,34,27",
        "hex": "#4c221b",
        "name": "紫檀",
        "desc": "紫檀：檀木的颜色，也称乌檀色乌木色"
    },
    {
        "cmyk": "100,88,28,16",
        "rgb": "0,51,113",
        "hex": "#003371",
        "name": "绀青",
        "desc": "绀青绀紫：纯度较低的深紫色"
    },
    {
        "cmyk": "66,100,33,36",
        "rgb": "86,0,79",
        "hex": "#56004f",
        "name": "紫棠",
        "desc": "紫棠：黑红色"
    },
    {
        "cmyk": "64,92,0,0",
        "rgb": "128,29,174",
        "hex": "#801dae",
        "name": "青莲",
        "desc": "青莲：偏蓝的紫色"
    },
    {
        "cmyk": "72,34,20,1",
        "rgb": "76,141,174",
        "hex": "#4c8dae",
        "name": "群青",
        "desc": "群青：深蓝色"
    },
    {
        "cmyk": "30,34,0,0",
        "rgb": "176,164,227",
        "hex": "#b0a4e3",
        "name": "雪青",
        "desc": "雪青：浅蓝紫色"
    },
    {
        "cmyk": "20,37,0,0",
        "rgb": "204,164,227",
        "hex": "#cca4e3",
        "name": "丁香色",
        "desc": "丁香色：紫丁香的颜色，浅浅的紫色，很娇柔淡雅的色彩"
    },
    {
        "cmyk": "5,19,7,0",
        "rgb": "237,209,216",
        "hex": "#edd1d8",
        "name": "藕色",
        "desc": "藕色：浅灰而略带红的颜色"
    },
    {
        "cmyk": "9,23,8,0",
        "rgb": "228,198,208  CMYK:\n  9,23,8,0  HEX: #e4c6d0",
        "hex": "#e4c6d0",
        "name": "藕荷色",
        "desc": "藕荷色：浅紫而略带红的颜色"
    },
    {
        "cmyk": "58,38,40,0",
        "rgb": "117,135,138",
        "hex": "#75878a",
        "name": "苍色",
        "desc": "苍色：即各种颜色掺入黑色后的颜色，如苍翠"
    },
    {
        "cmyk": "71,20,67,3",
        "rgb": "81,154,115",
        "hex": "#519a73",
        "name": "苍黄",
        "desc": ""
    },
    {
        "cmyk": "38,33,55,3",
        "rgb": "162,155,124",
        "hex": "#a29b7c",
        "name": "苍青",
        "desc": ""
    },
    {
        "cmyk": "58,32,25,1",
        "rgb": "115,151,171",
        "hex": "#7397ab",
        "name": "苍黑",
        "desc": ""
    },
    {
        "cmyk": "17,9,7,0",
        "rgb": "209,217,224",
        "hex": "#d1d9e0",
        "name": "苍白",
        "desc": ""
    },
    {
        "cmyk": "49,20,35,0",
        "rgb": "136,173,166",
        "hex": "#88ada6",
        "name": "水色",
        "desc": ""
    },
    {
        "cmyk": "2,19,0,0",
        "rgb": "243,211,231",
        "hex": "#f3d3e7",
        "name": "水红",
        "desc": ""
    },
    {
        "cmyk": "16,0,11,0",
        "rgb": "212,242,231",
        "hex": "#d4f2e7",
        "name": "水绿",
        "desc": ""
    },
    {
        "cmyk": "16,0,4,0",
        "rgb": "210,240,244",
        "hex": "#d2f0f4",
        "name": "水蓝",
        "desc": ""
    },
    {
        "cmyk": "15,7,0,0",
        "rgb": "211,224,243",
        "hex": "#d3e0f3",
        "name": "淡青",
        "desc": ""
    },
    {
        "cmyk": "57,0,10,0",
        "rgb": "48,2​​23,243",
        "hex": "#30dff3",
        "name": "湖蓝",
        "desc": ""
    },
    {
        "cmyk": "55,0,36,0",
        "rgb": "37,248,203",
        "hex": "#25f8cb",
        "name": "湖绿",
        "desc": ""
    },
    {
        "cmyk": "0,0,0,0",
        "rgb": "255,255,255",
        "hex": "#ffffff",
        "name": "精白",
        "desc": "精白：纯白，洁白，净白，粉白。 "
    },
    {
        "cmyk": "0,1,5,0",
        "rgb": "255,251,240",
        "hex": "#fffbf0",
        "name": "像牙白",
        "desc": "像牙白：乳白色"
    },
    {
        "cmyk": "4,0,1,0",
        "rgb": "240,252,255",
        "hex": "#f0fcff",
        "name": "雪白",
        "desc": "雪白：如雪般洁白"
    },
    {
        "cmyk": "15,1,4,0​​",
        "rgb": "214,236,240",
        "hex": "#d6ecf0",
        "name": "月白",
        "desc": "月白：淡蓝色"
    },
    {
        "cmyk": "4,5,12,0",
        "rgb": "242,236,222",
        "hex": "#f2ecde",
        "name": "缟",
        "desc": "缟：白色"
    },
    {
        "cmyk": "11,1,9,0",
        "rgb": "224,240,233",
        "hex": "#e0f0e9",
        "name": "素",
        "desc": "素：白色，无色"
    },
    {
        "cmyk": "3,0,5,0",
        "rgb": "243,249,241",
        "hex": "#f3f9f1",
        "name": "荼白",
        "desc": "荼白：如荼之白色"
    },
    {
        "cmyk": "7,2,1,0",
        "rgb": "233,241,246",
        "hex": "#e9f1f6",
        "name": "霜色",
        "desc": "霜色：白霜的颜色"
    },
    {
        "cmyk": "24,13,14,0",
        "rgb": "194,204,208  CMYK:\n  24,13,14,0  HEX: #c2ccd0",
        "hex": "#c2ccd0",
        "name": "花白",
        "desc": "花白：白色和黑色混杂的。斑白的 夹杂有灰色的白"
    },
    {
        "cmyk": "1,6,6,0",
        "rgb": "252,239,232",
        "hex": "#fcefe8",
        "name": "鱼肚白",
        "desc": "鱼肚白：似鱼腹部的颜色，多指黎明时东方的天色颜色"
    },
    {
        "cmyk": "9,0,1,0",
        "rgb": "227,239,253",
        "hex": "#e3f9fd",
        "name": "莹白",
        "desc": "莹白：晶莹洁白"
    },
    {
        "cmyk": "52,43,43,0",
        "rgb": "128,128,128",
        "hex": "#808080",
        "name": "灰色",
        "desc": "灰色：黑色和白色混和成的一种颜色"
    },
    {
        "cmyk": "7,10,35,0",
        "rgb": "238,222,176",
        "hex": "#eedeb0",
        "name": "牙色",
        "desc": "牙色：与像牙相似的淡黄色（注：暖白）"
    },
    {
        "cmyk": "4,3,2,0",
        "rgb": "240,240,244",
        "hex": "#f0f0f4",
        "name": "铅白",
        "desc": "铅白：铅粉的白色。铅粉，国画颜料，日久易氧化“返铅”变黑。铅粉在古时用以搽脸的化妆品。 （注：冷白）\n"
    },
    {
        "cmyk": "37,82,84,51",
        "rgb": "98,42,29",
        "hex": "#622a1d",
        "name": "玄色",
        "desc": "玄色：赤黑色，黑中带红的颜色，又泛指黑色"
    },
    {
        "cmyk": "76,73,46,39",
        "rgb": "61,59,79",
        "hex": "#3d3b4f",
        "name": "玄青",
        "desc": "玄青：深黑色"
    },
    {
        "cmyk": "61,67,28,8",
        "rgb": "114,94,130",
        "hex": "#725e82",
        "name": "乌色",
        "desc": "乌色：暗而呈黑的颜色"
    },
    {
        "cmyk": "74,76,49,49",
        "rgb": "57,47,65",
        "hex": "#392f41",
        "name": "乌黑",
        "desc": "乌黑：深黑"
    },
    {
        "cmyk": "81,74,57,73",
        "rgb": "22,24,35",
        "hex": "#161823",
        "name": "漆黑",
        "desc": "漆黑：非常黑的"
    },
    {
        "cmyk": "71,54,44,19",
        "rgb": "80,97,109",
        "hex": "#50616d",
        "name": "墨色",
        "desc": "墨色：即黑色"
    },
    {
        "cmyk": "58,39,31,2",
        "rgb": "117,138,153",
        "hex": "#758a99",
        "name": "墨灰",
        "desc": "墨灰：即黑灰"
    },
    {
        "cmyk": "75,68,67,90",
        "rgb": "0,0,0",
        "hex": "#000000",
        "name": "黑色",
        "desc": "黑色：亮度最低的非彩色的或消色差的物体的颜色；最暗的灰色；被认为特别属于那些既不能反射、又不能透过能使人感觉到的微小入射光的物体,任何亮度很低的物体颜色。 "
    },
    {
        "cmyk": "54,70,63,56",
        "rgb": "73,49,49",
        "hex": "#493131",
        "name": "缁色",
        "desc": "缁色：帛黑色"
    },
    {
        "cmyk": "61,67,69,70",
        "rgb": "49,37,32",
        "hex": "#312520",
        "name": "煤黑",
        "desc": "煤黑像牙黑：都是黑，不过有冷暖之分。 "
    },
    {
        "cmyk": "54,55,73,38",
        "rgb": "93,81,60",
        "hex": "#5d513c",
        "name": "黧",
        "desc": "黧：黑中带黄的颜色"
    },
    {
        "cmyk": "49,50,70,24",
        "rgb": "117,102,77",
        "hex": "#75664d",
        "name": "黎",
        "desc": "黎：黑中带黄似黎草色"
    },
    {
        "cmyk": "63,58,33,9",
        "rgb": "107,104,130",
        "hex": "#6b6882",
        "name": "黝",
        "desc": "黝：本义为淡黑色或微青黑色。 "
    },
    {
        "cmyk": "56,59,54,28",
        "rgb": "102,87,87",
        "hex": "#665757",
        "name": "黝黑",
        "desc": "黝黑：（皮肤暴露在太阳光下而晒成的）青黑色"
    },
    {
        "cmyk": "76,56,50,29",
        "rgb": "65,85,93",
        "hex": "#41555d",
        "name": "黯",
        "desc": "黯：深黑色、泛指黑色"
    },
    {
        "cmyk": "5,26,85,0",
        "rgb": "242,190,69",
        "hex": "#F2BE45",
        "name": "赤金",
        "desc": "赤金：足金的颜色"
    },
    {
        "cmyk": "9,16,64,0",
        "rgb": "234,205,118",
        "hex": "#eacd76",
        "name": "金色",
        "desc": "金色：平均为深黄色带光泽的颜色"
    },
    {
        "cmyk": "7,7,2,0",
        "rgb": "233,231,239",
        "hex": "#e9e7ef",
        "name": "银白",
        "desc": "银白：带银光的白色"
    },
    {
        "cmyk": "69,24,51,3",
        "rgb": "84,150,136",
        "hex": "#549688",
        "name": "铜绿",
        "desc": ""
    },
    {
        "cmyk": "34,38,87,7",
        "rgb": "167,142,68",
        "hex": "#a78e44",
        "name": "乌金",
        "desc": ""
    },
    {
        "cmyk": "27,12,20,0",
        "rgb": "186,202,198",
        "hex": "#bacac6",
        "name": "老银",
        "desc": "老银：金属氧化后的色彩"
    }
]
print(len(colors))